// $Id $
// реализация методов класса контроля и форматирования полей ввода с 
// выделением триад, разделенных пробелом и представленными классом QLineEdit 
//
// число в символьном виде представляется в форме: 000 000 000.00
//
// по умолчанию устанавливается:
//   количество знаков после запятой равным 2
//   контроль границ отключен.
//
// дата создания: 12-мая-2009г.
//
// разработчик:
//   Федотов А.Н.
// (с) fan, 2009, ЗАО "ФРАКТАЛЬ СБ"
//
//******************************************************************************
#include <iostream>
#include <QLineEdit>
#include <QTextStream>

#include "ctrl_input_field.h"

// глобальный идентификатор файла диагностики и системной статистики
extern  FILE  *file_log;

//------------------------------------------------------------------------------
//     класс представления делителей шкалы ординат
//==============================================================================
tab_spin_box_t::tab_spin_box_t(const double *atab, int elems, QWidget *parent )
:
   QDoubleSpinBox( parent ),
   tabd          ( atab   ),
   elements      ( elems  )
{                
   setRange( 0, elements-1 ); 
}; 
//------------------------------------------------------------------------------
//    
QString tab_spin_box_t::textFromValue( double value ) const
{     
   QString str;
   return str.setNum( *( tabd +(int)value ), 'g', 4 );
};
//------------------------------------------------------------------------------
// получить табличный индекс
int  tab_spin_box_t::get_index( double dd )
{
   for( int i = 0; i < elements; i++ )
   {
      if( dd < *(tabd + i ) )
         return( i - 1 );
   };   
   return (elements - 1 );
}; 
//------------------------------------------------------------------------------
